fix: project builder tools
